Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Внутренняя ошибка: контекст не является контекстом обучения модели лог. регрессии
en: Internal error: context is not the training context for the log. regression model

source: Количество столбцов с весами не может быть больше 1
en: The weight column count cannot be more than 1

source: HTTP метод "%s" в настоящее время не поддерживается
en: "%s" HTTP method not currently supported

source: Недопустимое имя заголовка %s
en: Invalid %s header name

source: Логистическая регрессия
en: Logistic Regression

source: Активация вычислителя "%s"
en: Activating worker "%s"

source: Заполнение выходных наборов данных
en: Appending output datasets

source: Создание вычислителя №%d
en: Creating worker #%d

source: Создание вычислителей
en: Creating workers

source: Недопустимая операция: изменение свойства LinkedVariables
en: Invalid operation: LinkedVariables property change

source: Количество столбцов в наборе данных отличается от предыдущей итерации
en: The column count in the dataset differs from the previous iteration

source: Типы данных столбцов в наборе данных отличаются от предыдущей итерации
en: The column data types in the dataset differ from the previous iteration

source: Файл "%s" недоступен
en: "%s" file unavailable

source: Не задано сравниваемое значение в условии завершения цикла
en: No comparison value specified for the loop termination condition

source: Выполнение компонента Условие в цикле невозможно
en: Execution of the Condition in the loop component is not possible

source: Не найден столбец "%s", используемый для группировки данных
en: "%s" column used for data grouping not found

source: Количество групп должно быть положительным
en: Group count must be positive

source: Не найден порт с идентификатором "%s", содержащий столбцы для группировки
en: No port with "%s" identifier containing columns to group found

source: Не задан порт, содержащий столбцы для группировки
en: No port containing columns to group specified

source: Количество строк в группе должно быть положительным
en: Group row count must be positive

source: Условие завершения цикла "%s" не совместимо с типом данных "%s"
en: "%s" loop termination condition is not compatible with "%s" data type

source: Максимальное количество потоков должно быть не меньше %d
en: Maximum thread count must be no less than %d

source: Некорректно настроены переменные, передаваемые с выхода на вход
en: Invalid mapped variables passed from output to input

source: Файл "%s" не найден
en: "%s" file not found

source: Количество итераций не может быть отрицательным
en: Iteration count cannot be negative

source: Превышено максимальное допустимое количество итераций: %d
en: Maximum allowable number of iterations exceeded: %d

source: Переменная цикла не может получать на вход значение выходной переменной
en: The loop variable cannot receive at the inlet the output variable value

source: Список соединяемых переменных содержит дублирующиеся ссылки на переменную "%s"
en: The linked variables list contains duplicate links to "%s" variable

source: Типы соединяемых переменных "%s" и "%s" не совместимы
en: Type mismatch between linked variables "%s" and "%s"

source: Отсутствует переменная для проверки условия завершения цикла
en: No variable to check the loop termination condition

source: При параллельном выполнении цикла возникла ошибка
en: Error occurred while processing parallel loop

source: Цикл с постусловием не поддерживает параллельную обработку
en: Posttested loop does not support parallel processing

source: Настройка порта не поддерживается
en: Port configuration not supported

source: Порт "%s" не является входным портом, содержащим набор данных
en: "%s" port is not input port containing dataset

source: Отсутствует ссылка на файловое хранилище
en: No reference to file storage

source: Некорректный тип интервала: %s (поддерживается ["Year", "Quarter", "Month", "Week", "Day", "Hour", "Minute", "Second"])
en: Incorrect interval type: %s (["Year", "Quarter", "Month", "Week", "Day", "Hour", "Minute", "Second"] supported)

source: Порт "%s" не настроен
en: "%s" port not configured

source: Порт "%s" имеет неподдерживаемый тип
en: Unsupported "%s" port type

source: группа
en: group

source: Определение групп в исходном наборе данных
en: Defining groups in the source dataset

source: Детальная информация об ошибке
en: Detailed error information

source: Идентификатор итерации
en: Iteration identifier

source: Итерация №%d
en: Iteration #%d

source: Статус выполнения итераций
en: Iteration execution status

source: Файл модуля "%s" не может быть загружен: превышено ограничение на допустимый размер файла (%d > %d байт)
en: "%s" module file cannot be loaded: the permissible file size limit is exceeded (%d > %d bytes)

source: Признак успешного завершения
en: Success flag field

source: итерационный
en: iterative

source: Подготовка вычислителя "%s"
en: Preparing worker "%s"

source: постусловие
en: postcondition

source: Запущено обучение узла с количеством итераций %d. Обучение с большим количеством итераций может вызывать ошибку переполнения памяти.
en: Node training started with iterations count %d. Training with many iterations can cause memory overflow error.

source: %s (цикл)
en: %s (loop)

source: Цикл
en: Loop

source: Многократное выполнение модели на новых данных
en: Multiple model execution based on new data

source: Размеры массивов фактических и прогнозируемых классов не совпадают
en: Actual and predicted array sizes mismatch

source: Размер массива коэффициентов для расчета F-меры не совпадает с количеством классов
en: The coefficient array size for F-measure calculation mismatches the class count

source: Не найден файл модуля "%s"
en: File of "%s" module not found

source: Подбор параметров нейросети
en: Selecting neural network parameters

source: Итерация %d
en: Iteration %d

source: Кросс-валидация
en: Cross-validating

source: Подготовка обучающего множества
en: Preparing training set

source: Подготовка валидационного множества
en: Preparing validation set

source: Невозможно продолжить обучение, так как структура обученной нейросети не соответствует новым параметрам обучения
en: Failed to continue training since the structure of the trained neural network does not correspond to the new training parameters

source: В выходном столбце классификатора присутствует неизвестный класс
en: Unknown class is present in the output classifier column

source: Размерность входных данных %d не соответствует количеству входов нейросети %d
en: The input data dimensionality %d mismatches the neural network inputs number %d

source: Не удалось разрешить имя модуля "%s"
en: Failed to resolve "%s" module name

source: Недопустимый тип нейрона: %d
en: Invalid neuron kind: %d

source: Количество нейронов в слое не совпадает с требуемым значением %d
en: The layer neuron count mismatches the required value %d

source: В данных допускаются только непустые конечные значения
en: Only non-empty final values are allowed in the data

source: До запроса грубого размера нейросети необходимо установить одинаковое число нейронов в скрытых слоях
en: Before requesting the coarse size of the neural network, the setting of the same number of neurons in the hidden layers is required

source: Невозможно выполнить запрошенную операцию на необученной нейросети
en: Failed to perform the requested operation using the untrained neural network

source: Заданное количество входных весов нейрона %d не совпадает с требуемым значением %d
en: The specified number of the input neuron weights %d mismatches the required number %d

source: Не заданы столбцы входных данных нейросети
en: Neural network input data columns not set

source: Не заданы столбцы выходных данных нейросети
en: Neural network output data columns not set

source: В обучающем множестве должны быть представители не менее 2 классов (сейчас %d)
en: Representatives of at least 2 classes (currently %d) must be present in the training set

source: Отсутствуют данные для обучения
en: No train data

source: Ошибка при чтении файла модуля "%s"
en: Error reading "%s" module file

source: В обучающем множестве отсутствуют валидные примеры
en: No valid examples in the training set

source: Длина строки %d не совпадает с количеством столбцов матрицы %d
en: Length of %d row does not match the column count in matrix %d

source: Обучение нейросети завершено с ошибкой
en: Neural network training failed

source: Указано одно или несколько недопустимых значений количества нейронов
en: One or several invalid neuron count values specified

source: Прогон входных данных
en: Traversing input data

source: Обучение: коэффициент регуляризации = %.6g
en: Training: decay coefficient = %.6g

source: Обучение: без скрытых слоев; коэффициент регуляризации = %.6g
en: Training: without hidden layers; decay coefficient = %.6g

source: Обучение: без скрытых слоев
en: Training: without hidden layers

source: Обучение: один скрытый слой = %d нейронов; коэффициент регуляризации = %.6g
en: Training: one hidden layer = %d neurons; decay coefficient = %.6g

source: Обучение: один скрытый слой = %d нейронов
en: Training: one hidden layer = %d neurons

source: Не указано имя модуля
en: No module name specified

source: Обучение: первый скрытый слой = %d нейронов; второй скрытый слой = %d нейронов; коэффициент регуляризации = %.6g
en: Training: first hidden layer = %d neurons; second hidden layer = %d neurons; decay coefficient = %.6g

source: Обучение: первый скрытый слой = %d нейронов; второй скрытый слой = %d нейронов
en: Training: first hidden layer = %d neurons; second hidden layer = %d neurons

source: Количество нейронов в скрытых слоях (одинаковое)
en: Number of neurons in the hidden layers (same)

source: Подготовка данных
en: Preparing data

source: Прогон на тестовом множестве
en: Traversing test dataset

source: Обучение нейросети
en: Training the neural network

source: Прогон на валидационном множестве
en: Validation dataset iteration

source: Недопустимый формат значения Content-Type: %s
en: Invalid Content-Type value format: %s

source: ID класса|Факт
en: Class ID|Actual

source: Нейросеть (клас.):
en: Neural Net (Class.):

source: Средняя абсолютная ошибка при кросс-валидации
en: The mean absolute error in cross validation

source: Средняя относительная ошибка при кросс-валидации
en: The mean relative error in cross validation

source: Недопустимый результат классификации в строке %d
en: Invalid classification result in row %d

source: Невозможно произвести экспорт содержимого MIME %s, поскольку ранее уже экспортирован альтернативный вариант
en: Failed to export MIME %s content as an alternative has already been exported

source: Нейросеть не обучена
en: Neural network is untrained

source: Не задано ни одного поля входных данных
en: No input data fields specified

source: В режиме обучения не задано ни одного поля выходных данных
en: No output data fields specified In the training mode

source: Вызов EndUpdateNeuralNetParameters без соответствующего BeginUpdateNeuralNetParameters
en: Call of EndUpdateNeuralNetParameters without corresponding BeginUpdateNeuralNetParameters

source: Входные столбцы не соответствуют обученной ранее модели
en: Input columns do not match previously trained model

source: Выходной столбец не соответствует обученной ранее модели
en: Output column does not match previously trained model

source: Индекс Джини
en: Gini index

source: %s|%s|G-тест
en: %s|%s|G-test

source: Попытка экспортировать часть WSDL-сообщения "%s", конфликтующую с ранее экспортированными данными
en: Attempt to export "%s" part of WSDL message conflicting with the previously exported data

source: %s|G-тест
en: %s|G-test

source: %s|%s|Число степеней свободы G-теста
en: %s|%s|Number of G-test degrees of freedom

source: %s|Число степеней свободы G-теста
en: %s|Number of G-test degrees of freedom

source: %s|%s|P-значение G-теста
en: %s|%s|P-value of G-test

source: %s|P-значение G-теста
en: %s|P-value of G-test

source: %s|%s|Взаимная информация
en: %s|%s|Mutual information

source: %s|Взаимная информация
en: %s|Mutual information

source: Выход нейросети
en: Neural network output

source: ID класса|Прогноз
en: Class ID|Prediction

source: Невозможно экспортировать значение %d в сообщение, связанное с элементом схемы типа "%s": %s
en: Failed to export value %d to the message associated with "%s" schema element: %s

source: Апостериорная вероятность
en: Posterior probability

source: Нейросеть (регр.):
en: Neural Net (Reg.):

source: Средняя абсолютная ошибка на тестовом множестве
en: The test set mean absolute error

source: Средняя относительная ошибка на тестовом множестве
en: The test set mean relative error

source: Кодовая страница "%s" не поддерживается
en: "%s" codepage not supported

source: %d-%d-%d не является допустимым значением даты
en: %d-%d-%d is not a valid date value

source: Средняя абсолютная ошибка на обучающем множестве
en: The mean absolute error of the training set

source: Средняя относительная ошибка на обучающем множестве
en: The mean relative error of the training set

source: Значение параметра "%s": (%f) не должно быть больше значения параметра "%s" (%f)
en: "%s": parameter value (%f) must not exceed "%s" parameter value (%f)

source: Невалидная UTF16 последовательность: %s
en: Invalid UTF16 sequence: %s

source: Инфимум функции активации выходного слоя
en: Output layer activation function infimum

source: Супремум функции активации выходного слоя
en: Output layer activation function supremum

source: Нейросеть (классификация)
en: Neural Net (classification)

source: Обучает многослойный персептрон для решения задачи классификации
en: Trains multilayer perceptron to complete the classification tasks

source: Нейросеть (регрессия)
en: Neural Net (regression)

source: Обучает многослойный персептрон для решения задачи регрессии
en: Trains multilayer perceptron to complete the regression tasks

source: Общий выходной набор
en: Common output dataset

source: Обучающий выходной набор
en: Training output dataset

source: Невалидная UTF8 последовательность: %s
en: Invalid UTF8 sequence: %s

source: Тестовый выходной набор
en: Test output dataset

source: Тестовое множество
en: Test set

source: Не выбрано поле для отбора со смещением.
en: Biased sampling field not selected.

source: Формирование тестового и обучающего множеств
en: Selection of test and training sets

source: Разрешить неизвестные окружения
en: Allow unknown environments

source: Контейнерный CLI
en: Container CLI

source: Несбалансированная операция Pop
en: Unbalanced Pop operation

source: Окружение
en: Environment

source: Известные окружения
en: Known environments

source: Только окружение по умолчанию
en: Default environment only

source: Путь интерпретатора
en: Interpreter path

source: Передавать переменные окружения узла
en: Pass node environment variables

source: Путь библиотеки
en: Library path

source: Окружение по умолчанию (PY_ENV)
en: Default environment (PY_ENV)

source: Использовать PY_ENV как
en: Use PY_ENV as

source: Имя образа
en: Image name

source: Путь venv
en: Venv path

source: Кодировщик HTTP-сообщений настроен на экспорт столбца с индексом #%d, однако источник данных содержит только %d значений
en: HTTP messages encoder is configured to export the column with index #%d, however the data source contains only %d values

source: Запускать в контейнере
en: Run in container

source: Здесь может быть код работы с данными
en: Data processing code can be here

source: Подготовка выходных столбцов
en: Preparing output columns

source: Создать pd.DataFrame по входному набору №1
en: Create pd.DataFrame from input dataset No1

source: Не удалось определить текущую директорию
en: Failed to get current directory

source: Выполнение Python запрещено параметрами безопасности
en: Python execution forbidden in security settings

source: Не удалось получить путь в файловой системе по пути файлового хранилища "%s"
en: Failed to resolve the file system path from the "%s" path in the file storage

source: Выполнение Python внутри процесса не поддерживается, Python запущен в отдельном процессе.
en: Python execution inside the process is not supported, Python is started in the separate process.

source: Входной порт необязательный
en: Input port is optional

source: Строка поиска "%s" встречается более одного раза
en: "%s" search string occurring more than once

source: Полученный выходной pd.DataFrame
en: Resulting output pd.DataFrame

source: Если включена опция "Разрешить формировать выходные столбцы из кода", структуру выходного набора можно подготовить по pd.DataFrame
en: If "Allow creating output columns in script" option is enabled, the output dataset structure can be prepared from pd.DataFrame

source: Python занят. Невозможно запустить предпросмотр
en: Python is busy. Failed to start preview

source: Python занят. Невозможно запустить проверку синтаксиса
en: Python is busy. Failed to start syntax checking

source: Не удалось захватить Python в течении установленного тайм-аута, т.к. код Python всё ещё выполняется в другом узле.
en: Failed to capture Python during the set timeout as Python code is still executing in another node.

source: filestoragepath(path) -- Получить путь в файловой системе по пути файлового хранилища Аргументы: path: str Путь в файловом хранилище. Результат: Путь в файловой системе.
en: filestoragepath(path) -- Resolve the path in the file system from the path in the file storage Arguments: path: str Path in the file storage. Result: Path in the file system.

source: getLocale() -- Получить имя локали текущего узла Результат: Имя локали текущего узла в соответствии с RFC 4646.
en: getLocale() -- Get locale name of the current node Result: Locale name of the current node according to RFC 4646.

source: Не удалось финализировать модуль numexpr
en: Failed to finalize numexpr module

source: Ресурс %s не найден
en: %s resource not found

source: Кодировщик HTTP-сообщений не проинициализирован
en: HTTP messages encoder not initialized

source: Ошибка при финализации TCL
en: Error occurred during TCL finalization

source: Ошибка при выгрузке расширения "%s"
en: Error occurred while unloading "%s" extension

source: Python уже выполняется
en: Python is already executing

source: Не удалось запустить "%s"
en: Failed to start "%s"

source: Путь интерпретатора Python, указанный в настройках приложения, не существует
en: Python interpreter path specified in application settings does not exist

source: Значение %d выходит за границы допустимых значений 32-битного целого
en: Value %d is out of 32-bit integer range

source: Невалидный файл "%"
en: Invalid file "%"

source: Ошибка при записи данных входной таблицы #%d
en: Error writing data of input table #%d

source: Исполняемый файл python3 не найден
en: Python3 executable file not found

source: Ошибка при чтении выходной таблицы #%d
en: Error reading output table #%d

source: Бесконечности и NaN не являются допустимыми числами с плавающей точкой для передачи в GET/POST запросах URL Encoded/URL Replacement
en: Infinities and NaN are not valid floating point numbers to be passed in GET/POST requests URL Encoded/URL Replacement

source: Окружение "%s" не входит в список разрешённых
en: Environment "%s" is not listed as allowed

source: Предварительный просмотр данных
en: Previewing data

source: Запись входных данных
en: Writing input data

source: Запись данных входной таблицы #%d
en: Writing data of input table #%d

source: Запись данных входной таблицы
en: Writing data of input table

source: Запись данных входных таблиц
en: Writing data of input tables

source: Выполнение интерпретатора Python завершилось с кодом ошибки %d
en: Python interpreter execution finished with error code %d

source: Выполнение интерпретатора Python было прервано сигналом %d
en: Python interpreter execution was interrupted by signal %d

source: Чтение выходной таблицы #%d
en: Reading output table #%d

source: Чтение выходной таблицы
en: Reading output table

source: Операция "%s" не содержит описания входящего сообщения
en: "%s" operation does not contain the incoming message description

source: Чтение выходных таблиц
en: Reading output tables

source: Предпросмотр уже запущен
en: Preview already running

source: Процесс интерпретатора Python принудительно остановлен по истечнии тайм-аута отмены
en: Python interpreter process killed after timeout

source: Не удалось выгрузить библиотеку "%s" из памяти процесса
en: Failed to unload "%s" library from the process memory

source: Библиотека "%s" не выгружена из памяти процесса. Это может являться следствием использования модуля, неподдерживаемого в режиме выполнения Python внутри процесса приложения. Для работы Python требуется перезапуск приложения.
en: "%s" library was not unloaded from the process memory. It can be caused by use of the module unsupported in the Python execution mode inside the application process. Application restart is required for Python operation.

source: Версия Python %d.%d не поддерживается. Минимальная поддерживаемая версия %d.%d.
en: Python version %d.%d is not supported. %d.%d is minimum supported version.

source: Не найдена библиотека python
en: Python library not found

source: Get($self, row, /) -- Получить значение ячейки столбца Аргументы: row: int Индекс строки таблицы. Результат: Значение ячейки в соответствие с типом столбца (bool, int, str, float или datetime.datetime). Если ячейка пустая, то возвращается None.
en: Get($self, row, /) -- Get column cell value Arguments: row: int Table row index. Result: Cell value according to the column type (bool, int, str, float or datetime.datetime). If the cell is null, None is returned.

source: "%s" не является HTTP-связыванием
en: "%s" is not HTTP binding

source: IsNull($self, row, /) -- Проверить, установлено ли значение в ячейке столбца Аргументы: row: int Индекс строки таблицы. Результат: True, если ячейка таблицы пустая. False, если в ячейке есть значение.
en: IsNull($self, row, /) -- Check if there is a value in the column cell Arguments: row: int Table row index. Result: True, if the table cell is null. False, if the table cell contains a value.

source: Set($self, value, /) -- Установить значение в ячейку столбца добавленной строки Аргументы: value: Union[bool, int, str, float, datetime.datetime, None] Значение совместимого со столбцом типа (bool, int, str, float, datetime.datetime, datetime.date, datetime.time, time.struct_time и их наследники) или None. Результат: None
en: Set($self, value, /) -- Set value in the column cell of the appended row Arguments: value: Union[bool, int, str, float, datetime.datetime, None] The value of the type compatible with column (bool, int, str, float, datetime.datetime, datetime.date, datetime.time, time.struct_time and their descendants) or None. Result: None

source: Описание столбца не содержит обязательное свойство '%s'
en: Column definition does not contain required '%s' property

source: Неверно указан вид данных
en: Invalid data kind

source: Неверно указан тип данных
en: Invalid data type

source: Неверно указано назначение
en: Invalid usage type

source: Объект Python не связан с рабочим объектом
en: Python object not associated with work object
